In [1]:
import pandas as pd

In [2]:
students = ['vivek','giri','gaurav','giri']
series = pd.Series(students)

In [3]:
series

0     vivek
1      giri
2    gaurav
3      giri
dtype: object

In [4]:
import numpy as np
np.nan == None

False

In [5]:
np.isnan(np.nan)

True

In [6]:
d = pd.Series( ['physics','chemistry','english'],index= ['alice','jack','molly'])
d

alice      physics
jack     chemistry
molly      english
dtype: object

In [7]:
d.iloc[2]  #finding location

'english'

In [8]:
d.loc['molly']

'english'

In [9]:
d[2]

'english'

In [10]:
d['molly']

'english'

In [11]:
d[0]

'physics'

loc gets rows (and/or columns) with particular labels.

iloc gets rows (and/or columns) at integer locations.

In [12]:
class_code = {90: 'physics',
             100: 'chemistry',
             102:  'geo',
             103:  'mqath'}
t = pd.Series(class_code)

In [13]:
t

90       physics
100    chemistry
102          geo
103        mqath
dtype: object

In [14]:
# if we find classn code withoutb iloc they are getting error that always use iloc


t[0]

KeyError: 0

In [15]:
s.iloc[0]

NameError: name 's' is not defined

In [16]:
grades = pd.Series([90,91,95,98])

total=0
for grade in grades:
    total+=grade
print(total/len(grades))

93.5

In [17]:
import numpy as np

In [18]:
total = np.sum(grades)
print(total/len(grades))

93.5

In [19]:
numbers = pd.Series(np.random.randint(0,1000,10000))

In [20]:
numbers.head()

0    566
1    492
2    710
3    895
4    553
dtype: int32

In [21]:
len(numbers)

10000

In [22]:
%%timeit -n 100
total = 0
for number in numbers:
    total+=number
    
total/len(numbers)

2.69 ms ± 245 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [23]:
%%timeit -n 100
total = np.sum(numbers)
total/len(numbers)

181 µs ± 16.1 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [24]:
a1 = np.random.rand(4)
a2 = np.random.rand(4, 1)
a3 = np.array([[1, 2, 3, 4]])
a4 = np.arange(1, 4, 1)
a5 = np.linspace(1 ,4, 4)

In [25]:
a1

array([0.53418525, 0.03737693, 0.95238244, 0.56235816])

In [26]:
a2

array([[0.64976648],
       [0.31038041],
       [0.08804465],
       [0.26789961]])

In [27]:
a3

array([[1, 2, 3, 4]])

In [28]:
a4

array([1, 2, 3])

In [29]:
a5

array([1., 2., 3., 4.])

In [30]:
a3.shape==a4.shape

False

In [31]:
a5.shape==a1.shape

True

In [32]:
a1.shape==a2.shape

False

In [33]:
import numpy as np

old = np.array([[1, 1, 1], [1, 1, 1]])
new = old
new[0, :2] = 0

print(old)

[[0 0 1]
 [1 1 1]]

In [34]:
np.random.randn(1,1,36)

array([[[ 0.81385458, -1.12703137, -1.12450671, -0.71439009,
         -0.04543873, -0.14783323, -0.38800656, -1.51698577,
          2.73995727,  0.44422108,  1.56311254,  0.83849017,
          0.53602825, -0.89942073, -0.38300956,  1.19506054,
         -1.7284958 ,  0.01482355, -0.08869837, -1.80771301,
          0.77844056,  0.71404043, -1.03354933,  0.30467925,
          0.86979613,  0.39812466, -1.37740415, -0.57796613,
          0.34223649,  0.34285681, -1.62155634, -0.89782658,
          0.19335751,  1.51396501,  0.16719526,  0.81940817]]])

In [35]:
p =np.arange(1,36)

In [36]:
p.reshape(7,5)

array([[ 1,  2,  3,  4,  5],
       [ 6,  7,  8,  9, 10],
       [11, 12, 13, 14, 15],
       [16, 17, 18, 19, 20],
       [21, 22, 23, 24, 25],
       [26, 27, 28, 29, 30],
       [31, 32, 33, 34, 35]])

In [37]:
import re

p = 'ACBCAC'

re.findall('[^AC]',p)

['B']

In [38]:
import numpy as np

old = np.array([[1, 1, 1], [1, 1, 1]])
new = old
new[0, :2] = 0

print(old)

[[0 0 1]
 [1 1 1]]

In [39]:
import re
s = 'ACAABAACAAAB'
result = re.findall('A{1,2}', s)
#L = len(result)

In [40]:
result

['A', 'AA', 'AA', 'AA', 'A']

In [1]:
import re

txt = "The rain in Spain"
x = re.split("\s", txt)
print(x)

['The', 'rain', 'in', 'Spain']

In [2]:
text4 = '''x,y,z?'''

In [3]:
re.findall('[xyz]',text4)

['x', 'y', 'z']

In [4]:
import numpy as np
 
# initializing points in
# numpy arrays
point1 = np.array((20,20))
point2 = np.array((20,20))
 
# subtracting vector
temp = point1 - point2
 
# doing dot product
# for finding
# sum of the squares
sum_sq = np.dot(temp.T, temp)
 
# Doing squareroot and
# printing Euclidean distance
print(np.sqrt(sum_sq))

0.0

In [5]:
import pandas as pd
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj1 = pd.Series(sdata)
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj2 = pd.Series(sdata, index=states)
obj3 = pd.isnull(obj2)

In [6]:
obj1

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [7]:
obj2

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [8]:
obj1

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [9]:
obj3

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [10]:
import math
math.isnan(obj2['California'])

True

In [11]:
obj2['California'] == None

False

In [12]:
obj3['California']

True

In [13]:
x = obj2['California']
obj2['California'] != x

True

In [14]:
import pandas as pd
d = {'1': 'Alice','2': 'Bob','3': 'Rita','4': 'Molly','5': 'Ryan'}
S1 = pd.Series(d)

In [15]:
S1

1    Alice
2      Bob
3     Rita
4    Molly
5     Ryan
dtype: object

In [16]:
S.iloc[0:3]

NameError: name 'S' is not defined

In [ ]:
numbers.head()

In [17]:
numbers+=2  #increasing 2 number of variable
numbers.head()

NameError: name 'numbers' is not defined

In [18]:
for label, value in numbers.iteritems():
    numbers.set_value(label, value+2)

NameError: name 'numbers' is not defined

In [19]:
%%timeit -n 10
pd.Series(np.random.randint(0,1000,1000))

for label, value in s.iteritems():
    s.loc[label] = value+2

NameError: name 's' is not defined

In [20]:
students_classes = pd.Series({'aron': 'history',
                    'vivek': 'data science',
                     'gaurav':'history',
                     'budha': 'shs'})

In [21]:
students_classes

aron           history
vivek     data science
gaurav         history
budha              shs
dtype: object

In [22]:
student_class = pd.Series(['physico','hist','math'], index=['kelly','kelly','kelly'])

In [23]:
student_class

kelly    physico
kelly       hist
kelly       math
dtype: object

In [24]:
all_student_class = students_classes.append(student_class)

C:\Users\qw\AppData\Local\Temp\ipykernel_6060\2466076283.py:1: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  all_student_class = students_classes.append(student_class)

In [25]:
all_student_class

aron           history
vivek     data science
gaurav         history
budha              shs
kelly          physico
kelly             hist
kelly             math
dtype: object

In [26]:
students_classes

aron           history
vivek     data science
gaurav         history
budha              shs
dtype: object

In [27]:
all_student_class['kelly']

kelly    physico
kelly       hist
kelly       math
dtype: object

In [28]:
record = pd.Series({'name':'aron',
                  'class':'physics',
                   'score':98})

record2 =pd.Series({'name':'vivek',
                  'class':'data science',
                   'score':97})

record3 = pd.Series({'name':'gaurav',
                   'class':'hist',
                    'score':96})

In [29]:
type(record)

pandas.core.series.Series

In [30]:
record2

name            vivek
class    data science
score              97
dtype: object

In [31]:
record3

name     gaurav
class      hist
score        96
dtype: object

In [32]:
df = pd.DataFrame([record,record2,record3],index=['school1','school2','school3'])       #join 3 record series data frame

In [33]:
df

           name         class  score
school1    aron       physics     98
school2   vivek  data science     97
school3  gaurav          hist     96

In [34]:
df.loc['school2']

name            vivek
class    data science
score              97
Name: school2, dtype: object

In [35]:
df.iloc[0]

name        aron
class    physics
score         98
Name: school1, dtype: object

In [36]:
df.iloc[2]

name     gaurav
class      hist
score        96
Name: school3, dtype: object

In [37]:
df.iloc[0:2,1:4]

                class  score
school1       physics     98
school2  data science     97

In [38]:
df.loc['school2','name']

'vivek'

In [39]:
df.loc['school1','name']

'aron'

In [40]:
df.T

       school1       school2 school3
name      aron         vivek  gaurav
class  physics  data science    hist
score       98            97      96

In [41]:
df.T.loc['name']

school1      aron
school2     vivek
school3    gaurav
Name: name, dtype: object

In [42]:
df.T.loc['score']

school1    98
school2    97
school3    96
Name: score, dtype: object

In [43]:
df.T.loc['class']

school1         physics
school2    data science
school3            hist
Name: class, dtype: object

In [44]:
df

           name         class  score
school1    aron       physics     98
school2   vivek  data science     97
school3  gaurav          hist     96

In [45]:
df.loc['school2']

name            vivek
class    data science
score              97
Name: school2, dtype: object

In [46]:
df.loc['school2','name']

'vivek'

In [47]:
type(df)

pandas.core.frame.DataFrame

In [48]:
print(type(df.loc['school2']['name'])) # should be datafreame

<class 'str'>

In [49]:
print(type(df.loc['school2'])) #should be series

<class 'pandas.core.series.Series'>

In [50]:
df.loc[: ,['name','score']]

           name  score
school1    aron     98
school2   vivek     97
school3  gaurav     96

In [51]:
df.loc[: ,['score','name']]

         score    name
school1     98    aron
school2     97   vivek
school3     96  gaurav

In [52]:
df.drop('score',axis=1)  #delete

           name         class
school1    aron       physics
school2   vivek  data science
school3  gaurav          hist

In [53]:
df['classrannking'] = None   #adding new column
df

           name         class  score classrannking
school1    aron       physics     98          None
school2   vivek  data science     97          None
school3  gaurav          hist     96          None

In [54]:
!cat datasets/Admission_Predict.csv

'cat' is not recognized as an internal or external command,
operable program or batch file.

In [55]:
df = pd.read_csv('Admission_Predict.csv', index_col=0)

In [56]:
df.head()

,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
Serial No.,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92
2,324,107,4,4.0,4.5,8.87,1,0.76
3,316,104,3,3.0,3.5,8.00,1,0.72
4,322,110,3,3.5,2.5,8.67,1,0.80
5,314,103,2,2.0,3.0,8.21,0,0.65

In [57]:
new_df = df.rename(columns={'GRE Score':'gre score', 
                   'TOEFL Score':'toefl score',
                   'University Rating':'university rating',
                   'SOP':'state of purpose',
                   'LOR':'letter of recommendation',
                   'CGPA':'cgpa',
                   'Research':'research',
                   'Chance of Admit':'chance of admit'})
new_df.head()

,gre score,toefl score,university rating,state of purpose,LOR,cgpa,research,Chance of Admit
Serial No.,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92
2,324,107,4,4.0,4.5,8.87,1,0.76
3,316,104,3,3.0,3.5,8.00,1,0.72
4,322,110,3,3.5,2.5,8.67,1,0.80
5,314,103,2,2.0,3.0,8.21,0,0.65

In [58]:
new_df1 = new_df.rename(columns={'LOR':'letter of purpose'})

In [59]:
new_df1

,gre score,toefl score,university rating,state of purpose,LOR,cgpa,research,Chance of Admit
Serial No.,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92
2,324,107,4,4.0,4.5,8.87,1,0.76
3,316,104,3,3.0,3.5,8.00,1,0.72
4,322,110,3,3.5,2.5,8.67,1,0.80
5,314,103,2,2.0,3.0,8.21,0,0.65
...,...,...,...,...,...,...,...,...
396,324,110,3,3.5,3.5,9.04,1,0.82
397,325,107,3,3.0,3.5,9.11,1,0.84
398,330,116,4,5.0,4.5,9.45,1,0.91
399,312,103,3,3.5,4.0,8.78,0,0.67
400,333,117,4,5.0,4.0,9.66,1,0.95

In [60]:
new_df1

,gre score,toefl score,university rating,state of purpose,LOR,cgpa,research,Chance of Admit
Serial No.,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92
2,324,107,4,4.0,4.5,8.87,1,0.76
3,316,104,3,3.0,3.5,8.00,1,0.72
4,322,110,3,3.5,2.5,8.67,1,0.80
5,314,103,2,2.0,3.0,8.21,0,0.65
...,...,...,...,...,...,...,...,...
396,324,110,3,3.5,3.5,9.04,1,0.82
397,325,107,3,3.0,3.5,9.11,1,0.84
398,330,116,4,5.0,4.5,9.45,1,0.91
399,312,103,3,3.5,4.0,8.78,0,0.67
400,333,117,4,5.0,4.0,9.66,1,0.95

In [61]:
new_df = new_df1.rename(mapper=str.strip, axis ='columns')   #two space or tab remove

In [62]:
new_df

,gre score,toefl score,university rating,state of purpose,LOR,cgpa,research,Chance of Admit
Serial No.,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92
2,324,107,4,4.0,4.5,8.87,1,0.76
3,316,104,3,3.0,3.5,8.00,1,0.72
4,322,110,3,3.5,2.5,8.67,1,0.80
5,314,103,2,2.0,3.0,8.21,0,0.65
...,...,...,...,...,...,...,...,...
396,324,110,3,3.5,3.5,9.04,1,0.82
397,325,107,3,3.0,3.5,9.11,1,0.84
398,330,116,4,5.0,4.5,9.45,1,0.91
399,312,103,3,3.5,4.0,8.78,0,0.67
400,333,117,4,5.0,4.0,9.66,1,0.95

In [63]:
new_df.columns

Index(['gre score', 'toefl score', 'university rating', 'state of purpose',
       'LOR', 'cgpa', 'research', 'Chance of Admit'],
      dtype='object')

In [64]:
cols = list(df.columns)

cols=[x.lower().strip() for x in cols]

df.columns=cols

df.head()

,gre score,toefl score,university rating,sop,lor,cgpa,research,chance of admit
Serial No.,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92
2,324,107,4,4.0,4.5,8.87,1,0.76
3,316,104,3,3.0,3.5,8.00,1,0.72
4,322,110,3,3.5,2.5,8.67,1,0.80
5,314,103,2,2.0,3.0,8.21,0,0.65

In [65]:
bool_mask = df['chance of admit']> 0.70

In [66]:
bool_mask

Serial No.
1       True
2       True
3       True
4       True
5      False
       ...
396     True
397     True
398     True
399    False
400     True
Name: chance of admit, Length: 400, dtype: bool

In [67]:
df.where(bool_mask).head()

,gre score,toefl score,university rating,sop,lor,cgpa,research,chance of admit
Serial No.,,,,,,,,
1,337.0,118.0,4.0,4.5,4.5,9.65,1.0,0.92
2,324.0,107.0,4.0,4.0,4.5,8.87,1.0,0.76
3,316.0,104.0,3.0,3.0,3.5,8.00,1.0,0.72
4,322.0,110.0,3.0,3.5,2.5,8.67,1.0,0.80
5,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [68]:
(df['chance of admit'] > 0.7) & (df['chance of admit'] > 0.9)

Serial No.
1       True
2      False
3      False
4      False
5      False
       ...
396    False
397    False
398     True
399    False
400     True
Name: chance of admit, Length: 400, dtype: bool

In [69]:
df['chance of admit'].gt(0.7) & df['chance of admit'].lt(0.9)

Serial No.
1      False
2       True
3       True
4       True
5      False
       ...
396     True
397     True
398    False
399    False
400    False
Name: chance of admit, Length: 400, dtype: bool

In [70]:
df['serial_number'] = df.index

df= df.set_index('chance of admit')
df.head()

,gre score,toefl score,university rating,sop,lor,cgpa,research,serial_number
chance of admit,,,,,,,,
0.92,337,118,4,4.5,4.5,9.65,1,1
0.76,324,107,4,4.0,4.5,8.87,1,2
0.72,316,104,3,3.0,3.5,8.00,1,3
0.80,322,110,3,3.5,2.5,8.67,1,4
0.65,314,103,2,2.0,3.0,8.21,0,5

In [71]:
df = df.reset_index()
df.head()

,chance of admit,gre score,toefl score,university rating,sop,lor,cgpa,research,serial_number
0,0.92,337,118,4,4.5,4.5,9.65,1,1
1,0.76,324,107,4,4.0,4.5,8.87,1,2
2,0.72,316,104,3,3.0,3.5,8.00,1,3
3,0.80,322,110,3,3.5,2.5,8.67,1,4
4,0.65,314,103,2,2.0,3.0,8.21,0,5

In [72]:
df1 = pd.read_csv('census.csv')

In [73]:
df1.head()

,SUMLEV,REGION,DIVISION,STATE,COUNTY,STNAME,CTYNAME,CENSUS2010POP,ESTIMATESBASE2010,POPESTIMATE2010,...,RDOMESTICMIG2011,RDOMESTICMIG2012,RDOMESTICMIG2013,RDOMESTICMIG2014,RDOMESTICMIG2015,RNETMIG2011,RNETMIG2012,RNETMIG2013,RNETMIG2014,RNETMIG2015
0,40,3,6,1,0,Alabama,Alabama,4779736,4780127,4785161,...,0.002295,-0.193196,0.381066,0.582002,-0.467369,1.030015,0.826644,1.383282,1.724718,0.712594
1,50,3,6,1,1,Alabama,Autauga County,54571,54571,54660,...,7.242091,-2.915927,-3.012349,2.265971,-2.530799,7.606016,-2.626146,-2.722002,2.592270,-2.187333
2,50,3,6,1,3,Alabama,Baldwin County,182265,182265,183193,...,14.832960,17.647293,21.845705,19.243287,17.197872,15.844176,18.559627,22.727626,20.317142,18.293499
3,50,3,6,1,5,Alabama,Barbour County,27457,27457,27341,...,-4.728132,-2.500690,-7.056824,-3.904217,-10.543299,-4.874741,-2.758113,-7.167664,-3.978583,-10.543299
4,50,3,6,1,7,Alabama,Bibb County,22915,22919,22861,...,-5.527043,-5.068871,-6.201001,-0.177537,0.177258,-5.088389,-4.363636,-5.403729,0.754533,1.107861

In [74]:
df1['SUMLEV'].unique()

array([40, 50], dtype=int64)

In [75]:
df1 = df1[df1['SUMLEV']==50]

In [76]:
df1.head()

,SUMLEV,REGION,DIVISION,STATE,COUNTY,STNAME,CTYNAME,CENSUS2010POP,ESTIMATESBASE2010,POPESTIMATE2010,...,RDOMESTICMIG2011,RDOMESTICMIG2012,RDOMESTICMIG2013,RDOMESTICMIG2014,RDOMESTICMIG2015,RNETMIG2011,RNETMIG2012,RNETMIG2013,RNETMIG2014,RNETMIG2015
1,50,3,6,1,1,Alabama,Autauga County,54571,54571,54660,...,7.242091,-2.915927,-3.012349,2.265971,-2.530799,7.606016,-2.626146,-2.722002,2.592270,-2.187333
2,50,3,6,1,3,Alabama,Baldwin County,182265,182265,183193,...,14.832960,17.647293,21.845705,19.243287,17.197872,15.844176,18.559627,22.727626,20.317142,18.293499
3,50,3,6,1,5,Alabama,Barbour County,27457,27457,27341,...,-4.728132,-2.500690,-7.056824,-3.904217,-10.543299,-4.874741,-2.758113,-7.167664,-3.978583,-10.543299
4,50,3,6,1,7,Alabama,Bibb County,22915,22919,22861,...,-5.527043,-5.068871,-6.201001,-0.177537,0.177258,-5.088389,-4.363636,-5.403729,0.754533,1.107861
5,50,3,6,1,9,Alabama,Blount County,57322,57322,57373,...,1.807375,-1.177622,-1.748766,-2.062535,-1.369970,1.859511,-0.848580,-1.402476,-1.577232,-0.884411

In [77]:
df1.keys()

Index(['SUMLEV', 'REGION', 'DIVISION', 'STATE', 'COUNTY', 'STNAME', 'CTYNAME',
       'CENSUS2010POP', 'ESTIMATESBASE2010', 'POPESTIMATE2010',
       'POPESTIMATE2011', 'POPESTIMATE2012', 'POPESTIMATE2013',
       'POPESTIMATE2014', 'POPESTIMATE2015', 'NPOPCHG_2010', 'NPOPCHG_2011',
       'NPOPCHG_2012', 'NPOPCHG_2013', 'NPOPCHG_2014', 'NPOPCHG_2015',
       'BIRTHS2010', 'BIRTHS2011', 'BIRTHS2012', 'BIRTHS2013', 'BIRTHS2014',
       'BIRTHS2015', 'DEATHS2010', 'DEATHS2011', 'DEATHS2012', 'DEATHS2013',
       'DEATHS2014', 'DEATHS2015', 'NATURALINC2010', 'NATURALINC2011',
       'NATURALINC2012', 'NATURALINC2013', 'NATURALINC2014', 'NATURALINC2015',
       'INTERNATIONALMIG2010', 'INTERNATIONALMIG2011', 'INTERNATIONALMIG2012',
       'INTERNATIONALMIG2013', 'INTERNATIONALMIG2014', 'INTERNATIONALMIG2015',
       'DOMESTICMIG2010', 'DOMESTICMIG2011', 'DOMESTICMIG2012',
       'DOMESTICMIG2013', 'DOMESTICMIG2014', 'DOMESTICMIG2015', 'NETMIG2010',
       'NETMIG2011', 'NETMIG2012', 'NETMIG2013', 'NETMIG2014', 'NETMIG2015',
       'RESIDUAL2010', 'RESIDUAL2011', 'RESIDUAL2012', 'RESIDUAL2013',
       'RESIDUAL2014', 'RESIDUAL2015', 'GQESTIMATESBASE2010',
       'GQESTIMATES2010', 'GQESTIMATES2011', 'GQESTIMATES2012',
       'GQESTIMATES2013', 'GQESTIMATES2014', 'GQESTIMATES2015', 'RBIRTH2011',
       'RBIRTH2012', 'RBIRTH2013', 'RBIRTH2014', 'RBIRTH2015', 'RDEATH2011',
       'RDEATH2012', 'RDEATH2013', 'RDEATH2014', 'RDEATH2015',
       'RNATURALINC2011', 'RNATURALINC2012', 'RNATURALINC2013',
       'RNATURALINC2014', 'RNATURALINC2015', 'RINTERNATIONALMIG2011',
       'RINTERNATIONALMIG2012', 'RINTERNATIONALMIG2013',
       'RINTERNATIONALMIG2014', 'RINTERNATIONALMIG2015', 'RDOMESTICMIG2011',
       'RDOMESTICMIG2012', 'RDOMESTICMIG2013', 'RDOMESTICMIG2014',
       'RDOMESTICMIG2015', 'RNETMIG2011', 'RNETMIG2012', 'RNETMIG2013',
       'RNETMIG2014', 'RNETMIG2015'],
      dtype='object')

In [78]:
df1.columns

Index(['SUMLEV', 'REGION', 'DIVISION', 'STATE', 'COUNTY', 'STNAME', 'CTYNAME',
       'CENSUS2010POP', 'ESTIMATESBASE2010', 'POPESTIMATE2010',
       'POPESTIMATE2011', 'POPESTIMATE2012', 'POPESTIMATE2013',
       'POPESTIMATE2014', 'POPESTIMATE2015', 'NPOPCHG_2010', 'NPOPCHG_2011',
       'NPOPCHG_2012', 'NPOPCHG_2013', 'NPOPCHG_2014', 'NPOPCHG_2015',
       'BIRTHS2010', 'BIRTHS2011', 'BIRTHS2012', 'BIRTHS2013', 'BIRTHS2014',
       'BIRTHS2015', 'DEATHS2010', 'DEATHS2011', 'DEATHS2012', 'DEATHS2013',
       'DEATHS2014', 'DEATHS2015', 'NATURALINC2010', 'NATURALINC2011',
       'NATURALINC2012', 'NATURALINC2013', 'NATURALINC2014', 'NATURALINC2015',
       'INTERNATIONALMIG2010', 'INTERNATIONALMIG2011', 'INTERNATIONALMIG2012',
       'INTERNATIONALMIG2013', 'INTERNATIONALMIG2014', 'INTERNATIONALMIG2015',
       'DOMESTICMIG2010', 'DOMESTICMIG2011', 'DOMESTICMIG2012',
       'DOMESTICMIG2013', 'DOMESTICMIG2014', 'DOMESTICMIG2015', 'NETMIG2010',
       'NETMIG2011', 'NETMIG2012', 'NETMIG2013', 'NETMIG2014', 'NETMIG2015',
       'RESIDUAL2010', 'RESIDUAL2011', 'RESIDUAL2012', 'RESIDUAL2013',
       'RESIDUAL2014', 'RESIDUAL2015', 'GQESTIMATESBASE2010',
       'GQESTIMATES2010', 'GQESTIMATES2011', 'GQESTIMATES2012',
       'GQESTIMATES2013', 'GQESTIMATES2014', 'GQESTIMATES2015', 'RBIRTH2011',
       'RBIRTH2012', 'RBIRTH2013', 'RBIRTH2014', 'RBIRTH2015', 'RDEATH2011',
       'RDEATH2012', 'RDEATH2013', 'RDEATH2014', 'RDEATH2015',
       'RNATURALINC2011', 'RNATURALINC2012', 'RNATURALINC2013',
       'RNATURALINC2014', 'RNATURALINC2015', 'RINTERNATIONALMIG2011',
       'RINTERNATIONALMIG2012', 'RINTERNATIONALMIG2013',
       'RINTERNATIONALMIG2014', 'RINTERNATIONALMIG2015', 'RDOMESTICMIG2011',
       'RDOMESTICMIG2012', 'RDOMESTICMIG2013', 'RDOMESTICMIG2014',
       'RDOMESTICMIG2015', 'RNETMIG2011', 'RNETMIG2012', 'RNETMIG2013',
       'RNETMIG2014', 'RNETMIG2015'],
      dtype='object')

In [79]:
columns_keep = [ 'STNAME', 'CTYNAME','BIRTHS2010', 'BIRTHS2011', 'BIRTHS2012', 'BIRTHS2013', 'BIRTHS2014','BIRTHS2015' 
               ,'POPESTIMATE2010','POPESTIMATE2011', 'POPESTIMATE2012', 'POPESTIMATE2013','POPESTIMATE2014', 'POPESTIMATE2015',]
df=df1[columns_keep]
df.head()

,STNAME,CTYNAME,BIRTHS2010,BIRTHS2011,BIRTHS2012,BIRTHS2013,BIRTHS2014,BIRTHS2015,POPESTIMATE2010,POPESTIMATE2011,POPESTIMATE2012,POPESTIMATE2013,POPESTIMATE2014,POPESTIMATE2015
1,Alabama,Autauga County,151,636,615,574,623,600,54660,55253,55175,55038,55290,55347
2,Alabama,Baldwin County,517,2187,2092,2160,2186,2240,183193,186659,190396,195126,199713,203709
3,Alabama,Barbour County,70,335,300,283,260,269,27341,27226,27159,26973,26815,26489
4,Alabama,Bibb County,44,266,245,259,247,253,22861,22733,22642,22512,22549,22583
5,Alabama,Blount County,183,744,710,646,618,603,57373,57711,57776,57734,57658,57673

In [80]:
df1=df1.set_index(['STNAME', 'CTYNAME'])
df1.head()

                        SUMLEV  REGION  DIVISION  STATE  COUNTY  \
STNAME  CTYNAME
Alabama Autauga County      50       3         6      1       1
        Baldwin County      50       3         6      1       3
        Barbour County      50       3         6      1       5
        Bibb County         50       3         6      1       7
        Blount County       50       3         6      1       9

                        CENSUS2010POP  ESTIMATESBASE2010  POPESTIMATE2010  \
STNAME  CTYNAME
Alabama Autauga County          54571              54571            54660
        Baldwin County         182265             182265           183193
        Barbour County          27457              27457            27341
        Bibb County             22915              22919            22861
        Blount County           57322              57322            57373

                        POPESTIMATE2011  POPESTIMATE2012  ...  \
STNAME  CTYNAME                                           ...
Alabama Autauga County            55253            55175  ...
        Baldwin County           186659           190396  ...
        Barbour County            27226            27159  ...
        Bibb County               22733            22642  ...
        Blount County             57711            57776  ...

                        RDOMESTICMIG2011  RDOMESTICMIG2012  RDOMESTICMIG2013  \
STNAME  CTYNAME
Alabama Autauga County          7.242091         -2.915927         -3.012349
        Baldwin County         14.832960         17.647293         21.845705
        Barbour County         -4.728132         -2.500690         -7.056824
        Bibb County            -5.527043         -5.068871         -6.201001
        Blount County           1.807375         -1.177622         -1.748766

                        RDOMESTICMIG2014  RDOMESTICMIG2015  RNETMIG2011  \
STNAME  CTYNAME
Alabama Autauga County          2.265971         -2.530799     7.606016
        Baldwin County         19.243287         17.197872    15.844176
        Barbour County         -3.904217        -10.543299    -4.874741
        Bibb County            -0.177537          0.177258    -5.088389
        Blount County          -2.062535         -1.369970     1.859511

                        RNETMIG2012  RNETMIG2013  RNETMIG2014  RNETMIG2015
STNAME  CTYNAME
Alabama Autauga County    -2.626146    -2.722002     2.592270    -2.187333
        Baldwin County    18.559627    22.727626    20.317142    18.293499
        Barbour County    -2.758113    -7.167664    -3.978583   -10.543299
        Bibb County       -4.363636    -5.403729     0.754533     1.107861
        Blount County     -0.848580    -1.402476    -1.577232    -0.884411

[5 rows x 98 columns]

In [81]:
df1.loc['Michigan','Washtenaw County']

SUMLEV          50.000000
REGION           2.000000
DIVISION         3.000000
STATE           26.000000
COUNTY         161.000000
                  ...
RNETMIG2011      5.191395
RNETMIG2012      1.248106
RNETMIG2013      4.226778
RNETMIG2014      3.801394
RNETMIG2015      0.595048
Name: (Michigan, Washtenaw County), Length: 98, dtype: float64

In [82]:
df1.loc[[('Michigan','Washtenaw County'),('Michigan','Wayne County')]]

                           SUMLEV  REGION  DIVISION  STATE  COUNTY  \
STNAME   CTYNAME
Michigan Washtenaw County      50       2         3     26     161
         Wayne County          50       2         3     26     163

                           CENSUS2010POP  ESTIMATESBASE2010  POPESTIMATE2010  \
STNAME   CTYNAME
Michigan Washtenaw County         344791             345066           345563
         Wayne County            1820584            1820641          1815199

                           POPESTIMATE2011  POPESTIMATE2012  ...  \
STNAME   CTYNAME                                             ...
Michigan Washtenaw County           349048           351213  ...
         Wayne County              1801273          1792514  ...

                           RDOMESTICMIG2011  RDOMESTICMIG2012  \
STNAME   CTYNAME
Michigan Washtenaw County          0.129569         -4.309822
         Wayne County            -13.340073        -10.271616

                           RDOMESTICMIG2013  RDOMESTICMIG2014  \
STNAME   CTYNAME
Michigan Washtenaw County         -1.780293         -2.955078
         Wayne County            -14.119617        -11.903253

                           RDOMESTICMIG2015  RNETMIG2011  RNETMIG2012  \
STNAME   CTYNAME
Michigan Washtenaw County         -6.078985     5.191395     1.248106
         Wayne County             -8.762835   -11.344758    -8.098421

                           RNETMIG2013  RNETMIG2014  RNETMIG2015
STNAME   CTYNAME
Michigan Washtenaw County     4.226778     3.801394     0.595048
         Wayne County       -11.732437    -9.161648    -6.010195

[2 rows x 98 columns]

In [83]:
data = pd.read_csv('class_grades.csv')

In [84]:
data.head()

   Prefix  Assignment  Tutorial  Midterm  TakeHome  Final
0       5       57.14     34.09    64.38     51.48  52.50
1       8       95.05    105.49    67.50     99.07  68.33
2       8       83.70     83.17      NaN     63.15  48.89
3       7         NaN       NaN    49.38    105.93  80.56
4       8       91.32     93.64    95.00    107.41  73.89

In [85]:
mask=data.isnull()
mask

    Prefix  Assignment  Tutorial  Midterm  TakeHome  Final
0    False       False     False    False     False  False
1    False       False     False    False     False  False
2    False       False     False     True     False  False
3    False        True      True    False     False  False
4    False       False     False    False     False  False
..     ...         ...       ...      ...       ...    ...
94   False        True     False    False     False  False
95   False        True     False    False     False  False
96   False       False     False    False     False  False
97   False       False     False    False     False  False
98   False       False     False    False     False  False

[99 rows x 6 columns]

In [86]:
data.dropna().head()

   Prefix  Assignment  Tutorial  Midterm  TakeHome  Final
0       5       57.14     34.09    64.38     51.48  52.50
1       8       95.05    105.49    67.50     99.07  68.33
4       8       91.32     93.64    95.00    107.41  73.89
5       7       95.00     92.58    93.12     97.78  68.06
6       8       95.05    102.99    56.25     99.07  50.00

In [87]:
data.fillna(0, inplace=True)

In [88]:
data.head()

   Prefix  Assignment  Tutorial  Midterm  TakeHome  Final
0       5       57.14     34.09    64.38     51.48  52.50
1       8       95.05    105.49    67.50     99.07  68.33
2       8       83.70     83.17     0.00     63.15  48.89
3       7        0.00      0.00    49.38    105.93  80.56
4       8       91.32     93.64    95.00    107.41  73.89

In [89]:
df=pd.read_csv('log.csv')

In [90]:
df.head()

         time    user       video  playback position paused  volume
0  1469974424  cheryl  intro.html                  5  False    10.0
1  1469974454  cheryl  intro.html                  6    NaN     NaN
2  1469974544  cheryl  intro.html                  9    NaN     NaN
3  1469974574  cheryl  intro.html                 10    NaN     NaN
4  1469977514     bob  intro.html                  1    NaN     NaN

In [91]:
df=df.set_index('time')
df=df.sort_index()
df.head()

              user          video  playback position paused  volume
time
1469974424  cheryl     intro.html                  5  False    10.0
1469974424     sue  advanced.html                 23  False    10.0
1469974454  cheryl     intro.html                  6    NaN     NaN
1469974454     sue  advanced.html                 24    NaN     NaN
1469974484  cheryl     intro.html                  7    NaN     NaN

In [92]:
df=df.reset_index()
df=df.set_index(['time','user'])
df.head()

                           video  playback position paused  volume
time       user
1469974424 cheryl     intro.html                  5  False    10.0
           sue     advanced.html                 23  False    10.0
1469974454 cheryl     intro.html                  6    NaN     NaN
           sue     advanced.html                 24    NaN     NaN
1469974484 cheryl     intro.html                  7    NaN     NaN

In [93]:
df=df.fillna(method='ffill')
df.head()

                           video  playback position  paused  volume
time       user
1469974424 cheryl     intro.html                  5   False    10.0
           sue     advanced.html                 23   False    10.0
1469974454 cheryl     intro.html                  6   False    10.0
           sue     advanced.html                 24   False    10.0
1469974484 cheryl     intro.html                  7   False    10.0

In [94]:
dataframe=pd.DataFrame({'a': [1,2,3,4,5],
            'b':[6,7,8,9,10],
            'c':['a','b','c','d','e']})

In [95]:
dataframe

   a   b  c
0  1   6  a
1  2   7  b
2  3   8  c
3  4   9  d
4  5  10  e

In [96]:
dataframe.replace(1, 100)

     a   b  c
0  100   6  a
1    2   7  b
2    3   8  c
3    4   9  d
4    5  10  e

In [97]:
dataframe.replace([1, 10],[100, 30])

     a   b  c
0  100   6  a
1    2   7  b
2    3   8  c
3    4   9  d
4    5  30  e

In [98]:
df=pd.read_csv('log.csv')

In [99]:
df.replace(to_replace=".html$",regex=True,value="webpage")

          time    user            video  playback position paused  volume
0   1469974424  cheryl     introwebpage                  5  False    10.0
1   1469974454  cheryl     introwebpage                  6    NaN     NaN
2   1469974544  cheryl     introwebpage                  9    NaN     NaN
3   1469974574  cheryl     introwebpage                 10    NaN     NaN
4   1469977514     bob     introwebpage                  1    NaN     NaN
5   1469977544     bob     introwebpage                  1    NaN     NaN
6   1469977574     bob     introwebpage                  1    NaN     NaN
7   1469977604     bob     introwebpage                  1    NaN     NaN
8   1469974604  cheryl     introwebpage                 11    NaN     NaN
9   1469974694  cheryl     introwebpage                 14    NaN     NaN
10  1469974724  cheryl     introwebpage                 15    NaN     NaN
11  1469974454     sue  advancedwebpage                 24    NaN     NaN
12  1469974524     sue  advancedwebpage                 25    NaN     NaN
13  1469974424     sue  advancedwebpage                 23  False    10.0
14  1469974554     sue  advancedwebpage                 26    NaN     NaN
15  1469974624     sue  advancedwebpage                 27    NaN     NaN
16  1469974654     sue  advancedwebpage                 28    NaN     5.0
17  1469974724     sue  advancedwebpage                 29    NaN     NaN
18  1469974484  cheryl     introwebpage                  7    NaN     NaN
19  1469974514  cheryl     introwebpage                  8    NaN     NaN
20  1469974754     sue  advancedwebpage                 30    NaN     NaN
21  1469974824     sue  advancedwebpage                 31    NaN     NaN
22  1469974854     sue  advancedwebpage                 32    NaN     NaN
23  1469974924     sue  advancedwebpage                 33    NaN     NaN
24  1469977424     bob     introwebpage                  1   True    10.0
25  1469977454     bob     introwebpage                  1    NaN     NaN
26  1469977484     bob     introwebpage                  1    NaN     NaN
27  1469977634     bob     introwebpage                  1    NaN     NaN
28  1469977664     bob     introwebpage                  1    NaN     NaN
29  1469974634  cheryl     introwebpage                 12    NaN     NaN
30  1469974664  cheryl     introwebpage                 13    NaN     NaN
31  1469977694     bob     introwebpage                  1    NaN     NaN
32  1469977724     bob     introwebpage                  1    NaN     NaN

In [100]:
s=pd.read_csv('presidents.csv')

In [101]:
s.head()

,#,President,Born,Age atstart of presidency,Age atend of presidency,Post-presidencytimespan,Died,Age
0,1,George Washington,"Feb 22, 1732[a]","57 years, 67 daysApr 30, 1789","65 years, 10 daysMar 4, 1797","2 years, 285 days","Dec 14, 1799","67 years, 295 days"
1,2,John Adams,"Oct 30, 1735[a]","61 years, 125 daysMar 4, 1797","65 years, 125 daysMar 4, 1801","25 years, 122 days","Jul 4, 1826","90 years, 247 days"
2,3,Thomas Jefferson,"Apr 13, 1743[a]","57 years, 325 daysMar 4, 1801","65 years, 325 daysMar 4, 1809","17 years, 122 days","Jul 4, 1826","83 years, 82 days"
3,4,James Madison,"Mar 16, 1751[a]","57 years, 353 daysMar 4, 1809","65 years, 353 daysMar 4, 1817","19 years, 116 days","Jun 28, 1836","85 years, 104 days"
4,5,James Monroe,"Apr 28, 1758","58 years, 310 daysMar 4, 1817","66 years, 310 daysMar 4, 1825","6 years, 122 days","Jul 4, 1831","73 years, 67 days"

In [102]:
s['First']=s['President']
s['First']=s['First'].replace('[ ].*','',regex=True)

In [103]:
s.head()

,#,President,Born,Age atstart of presidency,Age atend of presidency,Post-presidencytimespan,Died,Age,First
0,1,George Washington,"Feb 22, 1732[a]","57 years, 67 daysApr 30, 1789","65 years, 10 daysMar 4, 1797","2 years, 285 days","Dec 14, 1799","67 years, 295 days",George
1,2,John Adams,"Oct 30, 1735[a]","61 years, 125 daysMar 4, 1797","65 years, 125 daysMar 4, 1801","25 years, 122 days","Jul 4, 1826","90 years, 247 days",John
2,3,Thomas Jefferson,"Apr 13, 1743[a]","57 years, 325 daysMar 4, 1801","65 years, 325 daysMar 4, 1809","17 years, 122 days","Jul 4, 1826","83 years, 82 days",Thomas
3,4,James Madison,"Mar 16, 1751[a]","57 years, 353 daysMar 4, 1809","65 years, 353 daysMar 4, 1817","19 years, 116 days","Jun 28, 1836","85 years, 104 days",James
4,5,James Monroe,"Apr 28, 1758","58 years, 310 daysMar 4, 1817","66 years, 310 daysMar 4, 1825","6 years, 122 days","Jul 4, 1831","73 years, 67 days",James

In [104]:
del(s['First'])

In [105]:
def splitname(row):
    row['First']=row['President'].split(' ')[0]
    row['last']=row['President'].split(' ')[-1]
    return row

In [106]:
s=s.apply(splitname,axis='columns')

In [107]:
s.head()

,#,President,Born,Age atstart of presidency,Age atend of presidency,Post-presidencytimespan,Died,Age,First,last
0,1,George Washington,"Feb 22, 1732[a]","57 years, 67 daysApr 30, 1789","65 years, 10 daysMar 4, 1797","2 years, 285 days","Dec 14, 1799","67 years, 295 days",George,Washington
1,2,John Adams,"Oct 30, 1735[a]","61 years, 125 daysMar 4, 1797","65 years, 125 daysMar 4, 1801","25 years, 122 days","Jul 4, 1826","90 years, 247 days",John,Adams
2,3,Thomas Jefferson,"Apr 13, 1743[a]","57 years, 325 daysMar 4, 1801","65 years, 325 daysMar 4, 1809","17 years, 122 days","Jul 4, 1826","83 years, 82 days",Thomas,Jefferson
3,4,James Madison,"Mar 16, 1751[a]","57 years, 353 daysMar 4, 1809","65 years, 353 daysMar 4, 1817","19 years, 116 days","Jun 28, 1836","85 years, 104 days",James,Madison
4,5,James Monroe,"Apr 28, 1758","58 years, 310 daysMar 4, 1817","66 years, 310 daysMar 4, 1825","6 years, 122 days","Jul 4, 1831","73 years, 67 days",James,Monroe

In [108]:
#del(s['First'])
#del(s['last'])
del(s['first'])

KeyError: 'first'

In [ ]:
s.head(1)

In [109]:
pattern = "(^[\w]*)(?:.*)([\w]*$)"
s['President'].str.extract(pattern).head()

        0 1
0  George
1    John
2  Thomas
3   James
4   James

In [110]:
names= "(?P<first>^[\w]*)(?:.*)(?P<last>)([\w]*$)"

s['President'].str.extract(names).head()

    first last 2
0  George
1    John
2  Thomas
3   James
4   James

In [111]:
s['first']=names['first']
s['last']=names['last']
s.head()

TypeError: string indices must be integers

In [112]:
s['Born']=s['Born'].str.extract('([\w]{3} [\w]{1,2}, [\w]{4})')
s['Born'].head()

0    Feb 22, 1732
1    Oct 30, 1735
2    Apr 13, 1743
3    Mar 16, 1751
4    Apr 28, 1758
Name: Born, dtype: object

In [113]:
student = pd.DataFrame([{'name':'vivek','role':'datascientist'},
                        {'name':'gaurav','role':'analyst'},
                         {'name':'pilu','role':'engineer'}])

student=student.set_index('name')

staff = pd.DataFrame([{'name':'alex','role':'electrician'},
                      {'name':'bob','role':'business'},
                      {'name':'red','role':'law'}])

staff= staff.set_index('name')

In [114]:
data= pd.merge(student, staff, how='outer', left_index=True, right_index=True)

In [115]:
data

               role_x       role_y
name
alex              NaN  electrician
bob               NaN     business
gaurav        analyst          NaN
pilu         engineer          NaN
red               NaN          law
vivek   datascientist          NaN

In [116]:
pd.merge(student, staff, how='inner', left_index=True, right_index=True)

Empty DataFrame
Columns: [role_x, role_y]
Index: []

In [117]:
data= pd.merge(student, staff, how='left', left_index=True, right_index=True)

In [118]:
data

               role_x role_y
name
vivek   datascientist    NaN
gaurav        analyst    NaN
pilu         engineer    NaN

In [119]:
student = pd.DataFrame([{'name':'vivek','role':'datascientist','school':'budha mohallla'},
                        {'name':'gaurav','role':'analyst','school':'backstreet'},
                         {'name':'pilu','role':'engineer','school':'lightstreet'}])


staff = pd.DataFrame([{'name':'alex','role':'electrician','location':'park avenue'},
                      {'name':'bob','role':'business','location':'123 street'},
                      {'name':'red','role':'law','location':'8373lighthouse'}])

In [120]:
pd.merge(student, staff, how='right', on='name')

   name role_x school       role_y        location
0  alex    NaN    NaN  electrician     park avenue
1   bob    NaN    NaN     business      123 street
2   red    NaN    NaN          law  8373lighthouse

In [121]:
%%capture
df_2011=pd.read_csv('MERGED2010_11_PP.csv',error_bad_lines=False)
df_2012=pd.read_csv('MERGED2011_12_PP.csv',error_bad_lines=False)
df_2013=pd.read_csv('MERGED2012_13_PP.csv',error_bad_lines=False)

In [122]:
df_2011.head()

,UNITID,OPEID,OPEID6,INSTNM,CITY,STABBR,ZIP,ACCREDAGENCY,INSTURL,NPCURL,...,OMAWDP8_NOTFIRSTTIME_POOLED_SUPP,OMENRUP_NOTFIRSTTIME_POOLED_SUPP,OMENRYP_FULLTIME_POOLED_SUPP,OMENRAP_FULLTIME_POOLED_SUPP,OMAWDP8_FULLTIME_POOLED_SUPP,OMENRUP_FULLTIME_POOLED_SUPP,OMENRYP_PARTTIME_POOLED_SUPP,OMENRAP_PARTTIME_POOLED_SUPP,OMAWDP8_PARTTIME_POOLED_SUPP,OMENRUP_PARTTIME_POOLED_SUPP
0,100654,100200,1002,Alabama A & M University,Normal,AL,35762,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,100663,105200,1052,University of Alabama at Birmingham,Birmingham,AL,35294-0110,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,100690,2503400,25034,Amridge University,Montgomery,AL,36117-3553,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,100706,105500,1055,University of Alabama in Huntsville,Huntsville,AL,35899,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,100724,100500,1005,Alabama State University,Montgomery,AL,36104-0271,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [123]:
print(len(df_2011))

7414

In [124]:
frames = [df_2011,df_2012,df_2013]
pd.concat(frames)

,UNITID,OPEID,OPEID6,INSTNM,CITY,STABBR,ZIP,ACCREDAGENCY,INSTURL,NPCURL,...,OMAWDP8_NOTFIRSTTIME_POOLED_SUPP,OMENRUP_NOTFIRSTTIME_POOLED_SUPP,OMENRYP_FULLTIME_POOLED_SUPP,OMENRAP_FULLTIME_POOLED_SUPP,OMAWDP8_FULLTIME_POOLED_SUPP,OMENRUP_FULLTIME_POOLED_SUPP,OMENRYP_PARTTIME_POOLED_SUPP,OMENRAP_PARTTIME_POOLED_SUPP,OMAWDP8_PARTTIME_POOLED_SUPP,OMENRUP_PARTTIME_POOLED_SUPP
0,100654.0,100200,1002,Alabama A & M University,Normal,AL,35762,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,100663.0,105200,1052,University of Alabama at Birmingham,Birmingham,AL,35294-0110,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,100690.0,2503400,25034,Amridge University,Montgomery,AL,36117-3553,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,100706.0,105500,1055,University of Alabama in Huntsville,Huntsville,AL,35899,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,100724.0,100500,1005,Alabama State University,Montgomery,AL,36104-0271,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7788,47691101.0,4205801,42058,SAE Institute of Technology San Francisco,Emeryville,CA,94608,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7789,47701101.0,10145905,1459,Strayer University-Bloomington Campus,Bloomington,MN,554311411,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7790,47702001.0,10145903,1459,Strayer University-Schaumburg Campus,Schaumburg,IL,601735081,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7791,47702002.0,10145902,1459,Strayer University-Downers Grove Campus,Downers Grove,IL,605151169,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7792,47702003.0,10145906,1459,Strayer University-Aurora Campus,Aurora,IL,605066220,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [125]:
pd.concat(frames, keys=[df_2011,df_2012,df_2013])

ValueError: Unable to coerce to Series, length must be 1977: given 3

In [1]:
df = pd.read_csv('census.csv')
df.head(1)

NameError: name 'pd' is not defined

In [ ]:
(df.where(df['SUMLEV']==50).dropna()
   .set_index(['CTYNAME','STNAME'])
   .rename(columns={'ESTIMATEBASE2010':'estimate base 2010'}))

In [ ]:
df=df[df['SUMLEV']==50]
df.set_index(['CTYNAME','STNAME'],inplace=True)
df.rename(columns={'ESTIMATEBASE2010':'estimate base2010'})

In [ ]:
import timeit

def first_approach():
    global df
    return (df.where(df['SUMLEV']==50).dropna()
   .set_index(['CTYNAME','STNAME'])
   .rename(columns={'ESTIMATEBASE2010':'estimate base 2010'}))
           
df=pd.read_csv('census.csv')     

timeit.timeit(first_approach, number=10)

In [ ]:
def second_approach():
    global df
    new_df=df[df['SUMLEV']==50]
    new_df.set_index(['CTYNAME','STNAME'],inplace=True)
    return new_df.rename(columns={'ESTIMATEBASE2010':'estimate base2010'})

new_df = pd.read_csv('census.csv')

timeit.timeit(second_approach, number=10)

In [ ]:
def min_max(row):
    data=row[['POPESTIMATE2010',
              'POPESTIMATE2011',
              'POPESTIMATE2012',
              'POPESTIMATE2013',
              'POPESTIMATE2014',
              'POPESTIMATE2015']]
    return pd.Series({'min':np.min(data),'max':np.max(data)})

In [ ]:
df.apply(min_max,axis='columns').head()

In [ ]:
def min_max(row):
    data=row[['POPESTIMATE2010',
              'POPESTIMATE2011',
              'POPESTIMATE2012',
              'POPESTIMATE2013',
              'POPESTIMATE2014',
              'POPESTIMATE2015']]
    row['min']=np.min(data)
    row['max']=np.max(data)
    return row
df.apply(min_max, axis='columns')

In [ ]:
rows  =      ['POPESTIMATE2010',
              'POPESTIMATE2011',
              'POPESTIMATE2012',
              'POPESTIMATE2013',
              'POPESTIMATE2014',
              'POPESTIMATE2015']
df.apply(lambda x: np.max(x['rows']),axis=1).head()